In [1]:
# import libraries at the top of your notebook
import pandas as pd
import sqlite3

In [2]:
# ! pip3 install pandas

In [3]:
conn = sqlite3.connect("../data/bootcamp_db")

In [4]:
conn

In [5]:
# You can run this code, if you need a reminder of the tables in the database

sql_query = """SELECT name 
               FROM sqlite_master 
               WHERE type='table';"""

cursor = conn.cursor()

# executing our sql query
cursor.execute(sql_query)

 
# printing all tables list
print(f"List of tables in the database:\n{cursor.fetchall()}")

List of tables in the database:
[('online_transactions',), ('stock_description',)]

In [6]:
query = """
select *
from online_transactions
limit 10
"""

test = pd.read_sql(query, conn)

In [7]:
type(test)

pandas.core.frame.DataFrame

In [8]:
test.shape

(10, 7)

In [9]:
test.head()

,invoice,stock_code,quantity,invoice_date,price,customer_id,country
0,536370,21791,24,2010-12-01 08:45:00,1.25,u12583,France
1,536373,82494L,6,2010-12-01 09:02:00,2.55,u1785,United Kingdom
2,536378,21929,10,2010-12-01 09:37:00,1.95,u14688,United Kingdom
3,536381,37444A,1,2010-12-01 09:41:00,2.95,u15311,United Kingdom
4,536381,15056BL,2,2010-12-01 09:41:00,5.95,u15311,United Kingdom

In [10]:
# query the entire online transactions table and store it as a variable call online_trans

query = """
select *
from online_transactions
"""

online_trans = pd.read_sql(query, conn)

In [11]:
online_trans.head()

,invoice,stock_code,quantity,invoice_date,price,customer_id,country
0,536370,21791,24,2010-12-01 08:45:00,1.25,u12583,France
1,536373,82494L,6,2010-12-01 09:02:00,2.55,u1785,United Kingdom
2,536378,21929,10,2010-12-01 09:37:00,1.95,u14688,United Kingdom
3,536381,37444A,1,2010-12-01 09:41:00,2.95,u15311,United Kingdom
4,536381,15056BL,2,2010-12-01 09:41:00,5.95,u15311,United Kingdom

In [12]:
online_trans.shape

(541910, 7)

In [13]:
online_trans.describe()

            quantity          price
count  541910.000000  541910.000000
mean        9.552234       4.611138
std       218.080957      96.759765
min    -80995.000000  -11062.060000
25%         1.000000       1.250000
50%         3.000000       2.080000
75%        10.000000       4.130000
max     80995.000000   38970.000000

In [14]:
# query the entire stock description table and store it as a variable call stock_description


query = """
select *
from stock_description
"""

stock_description = pd.read_sql(query, conn)

In [15]:
stock_description.head()

  stock_code                  description
0      10002  INFLATABLE POLITICAL GLOBE
1      10080     GROOVY CACTUS INFLATABLE
2      10120                 DOGGY RUBBER
3     10123C        HEARTS WRAPPING TAPE
4     10124A  SPOTS ON RED BOOKCOVER TAPE

In [16]:
stock_description.shape

(3952, 2)

In [17]:
conn.close()

In [18]:
# can you join the two tables together
# option 1 - write a sql query

# option 2 - use the merge function in pandas